from random import *

m = 10    # РОЗМІРИ
n = 10    # ПОЛЯ

броненосець_x1, броненосець_y1, броненосець_x2, броненосець_y2, броненосець_x3, броненосець_y3, броненосець_x4,\
броненосець_y4 = map(int, input('Введіть коорднати клітинок броненосця(x1, y1, x2, y2, x3, y3, x4, y4): ').split(', '))

лінкорн_x1_1, лінкорн_y1_1, лінкорн_x2_1, лінкорн_y2_1, лінкорн_x3_1, лінкорн_y3_1\
    = map(int, input('Введіть коорднати клітинок першого лінкорна(x1, y1, x2, y2, x3, y3): ').split(', '))

лінкорн_x1_2, лінкорн_y1_2, лінкорн_x2_2, лінкорн_y2_2, лінкорн_x3_2, лінкорн_y3_2\
    = map(int, input('Введіть коорднати клітинок другого лінкорна(x1, y1, x2, y2, x3, y3): ').split(', '))

корабель_x1_1, корабель_y1_1, корабель_x2_1, корабель_y2_1\
    = map(int, input('Введіть коорднати клітинок першого корабель(x1, y1, x2, y2): ').split(', '))

корабель_x1_2, корабель_y1_2, корабель_x2_2, корабель_y2_2\
    = map(int, input('Введіть коорднати клітинок другого корабель(x1, y1, x2, y2): ').split(', '))

корабель_x1_3, корабель_y1_3, корабель_x2_3, корабель_y2_3\
    = map(int, input('Введіть коорднати клітинок третього корабель(x1, y1, x2, y2): ').split(', '))

катер_x1_1, катер_y1_1 = map(int, input('Введіть коорднати клітинок першого корабель(x1, y1): ').split(', '))

катер_x1_2, катер_y1_2 = map(int, input('Введіть коорднати клітинок другого корабель(x1, y1): ').split(', '))

катер_x1_3, катер_y1_3 = map(int, input('Введіть коорднати клітинок третього корабель(x1, y1): ').split(', '))

катер_x1_4, катер_y1_4 = map(int, input('Введіть коорднати клітинок четвертого корабель(x1, y1): ').split(', '))

