from random import *

биті_клитинки_x = []
биті_клитинки_y = []
m = 10    # РОЗМІРИ
n = 10    # ПОЛЯ
кількість_знищених_кораблів = 0
порядок = 0

while кількість_знищених_кораблів < 20:

    x = randint(1, 10)
    i = биті_клитинки_x.count(x)
    while i != 0:
        x = randint(1, 10)
        i = биті_клитинки_x.count(x)

    y = randint(1, 10)
    j = биті_клитинки_y.count(y)
    while j != 0:
        y = randint(1, 10)
        j = биті_клитинки_y.count(y)

    print(x, '|', y)
    биті_клитинки_x.append(x)
    биті_клитинки_y.append(y)
    f = input('(Промах, попав, вбив)')
    if f == 'Промах':
        continue
    elif f == 'вбив':
        кількість_знищених_кораблів += 1
    elif f == 'попав':
        кількість_знищених_кораблів += 1

        порядок = 0
        x1 = x
        x1 = x1 + 1
        биті_клитинки_x.append(x1)
        print(x1, '|', y)
        f = input('(Промах, попав, вбив)')
        if f == 'вбив':
            кількість_знищених_кораблів += 1
        elif f == 'попав':
            x1 = x1 + 1
            порядок = 0
            while порядок < 4 or кількість_знищених_кораблів < 20:
                биті_клитинки_x.append(x1)
                print(x1, '|', y)
                f = input('(Промах, попав, вбив)')
                if f == 'Промах':
                    порядок = 4
                    break
                elif f == 'вбив':
                    кількість_знищених_кораблів += 1
                    break
                elif f == 'попав':
                    x1 += 1
                    кількість_знищених_кораблів += 1
                    порядок = 0
                    x1 = x1 + 1
                    биті_клитинки_x.append(x1)
                    print(x1, '|', y)
                    f = input('(Промах, попав, вбив)')
                    if f == 'вбив':
                        кількість_знищених_кораблів += 1
                    elif f == 'попав':
                        x1 = x1 + 1
                        порядок = 0
                        while порядок < 4 or кількість_знищених_кораблів < 20:
                            биті_клитинки_x.append(x1)
                            print(x1, '|', y)
                            f = input('(Промах, попав, вбив)')
                            if f == 'Промах':
                                порядок = 4
                                break
                            elif f == 'вбив':
                                кількість_знищених_кораблів += 1
                                break
                            elif f == 'попав':
                                x1 += 1
                                кількість_знищених_кораблів += 1
                                порядок = 0
                                x1 = x1 + 1
                                биті_клитинки_x.append(x1)
                                print(x1, '|', y)
                                f = input('(Промах, попав, вбив)')
                                if f == 'вбив':
                                    кількість_знищених_кораблів += 1
                                elif f == 'попав':
                                    x1 = x1 + 1
                                    порядок = 0
                                    while порядок < 4 or кількість_знищених_кораблів < 20:
                                        биті_клитинки_x.append(x1)
                                        print(x1, '|', y)
                                        f = input('(Промах, попав, вбив)')
                                        if f == 'Промах':
                                            порядок = 4
                                            break
                                        elif f == 'вбив':
                                            кількість_знищених_кораблів += 1
                                            break
                                        elif f == 'попав':
                                            x1 += 1
                                            кількість_знищених_кораблів += 1
                                            порядок = 0
                                            x1 = x1 + 1
                                            биті_клитинки_x.append(x1)
                                            print(x1, '|', y)
                                            f = input('(Промах, попав, вбив)')
                                            if f == 'вбив':
                                                кількість_знищених_кораблів += 1
                                            elif f == 'попав':
                                                x1 = x1 + 1
                                                порядок = 0
                                                while порядок < 4 or кількість_знищених_кораблів < 20:
                                                    биті_клитинки_x.append(x1)
                                                    print(x1, '|', y)
                                                    f = input('(Промах, попав, вбив)')
                                                    if f == 'Промах':
                                                        порядок = 4
                                                        break
                                                    elif f == 'вбив':
                                                        кількість_знищених_кораблів += 1
                                                        break
                                                    elif f == 'попав':
                                                        x1 += 1
                                                        кількість_знищених_кораблів += 1

        порядок = 0
        x2 = x
        x2 = x2 - 1
        биті_клитинки_x.append(x2)
        print(x2, '|', y)
        f = input('(Промах, попав, вбив)')
        if f == 'вбив':
            кількість_знищених_кораблів += 1
        elif f == 'попав':
            биті_клитинки_x.append(x2)
            x2 = x2 - 1
            порядок = 0
            while порядок < 4 or кількість_знищених_кораблів < 20:
                x2 = x2 - 1
                биті_клитинки_x.append(x2)
                print(x2, '|', y)
                f = input('(Промах, попав, вбив)')
                if f == 'Промах':
                    порядок = 4
                    break
                elif f == 'вбив':
                    кількість_знищених_кораблів += 1
                    break
                elif f == 'попав':
                    x2 = x2 - 1
                    кількість_знищених_кораблів += 1
                    порядок = 0
                    x2 = x2 - 1
                    биті_клитинки_x.append(x2)
                    print(x2, '|', y)
                    f = input('(Промах, попав, вбив)')
                    if f == 'вбив':
                        кількість_знищених_кораблів += 1
                    elif f == 'попав':
                        x2 = x2 - 1
                        порядок = 0
                        while порядок < 4 or кількість_знищених_кораблів < 20:
                            x2 = x2 - 1
                            биті_клитинки_x.append(x2)
                            print(x2, '|', y)
                            f = input('(Промах, попав, вбив)')
                            if f == 'Промах':
                                порядок = 4
                                break
                            elif f == 'вбив':
                                кількість_знищених_кораблів += 1
                                break
                            elif f == 'попав':
                                x2 = x2 - 1
                                кількість_знищених_кораблів += 1
                                порядок = 0
                                x2 = x2 - 1
                                биті_клитинки_x.append(x2)
                                print(x2, '|', y)
                                f = input('(Промах, попав, вбив)')
                                if f == 'вбив':
                                    кількість_знищених_кораблів += 1
                                elif f == 'попав':
                                    x2 = x2 - 1
                                    порядок = 0
                                    while порядок < 4 or кількість_знищених_кораблів < 20:
                                        x2 = x2 - 1
                                        биті_клитинки_x.append(x2)
                                        print(x2, '|', y)
                                        f = input('(Промах, попав, вбив)')
                                        if f == 'Промах':
                                            порядок = 4
                                            break
                                        elif f == 'вбив':
                                            кількість_знищених_кораблів += 1
                                            break
                                        elif f == 'попав':
                                            x2 = x2 - 1
                                            кількість_знищених_кораблів += 1
                                            порядок = 0
                                            x2 = x2 - 1
                                            биті_клитинки_x.append(x2)
                                            print(x2, '|', y)
                                            f = input('(Промах, попав, вбив)')
                                            if f == 'вбив':
                                                кількість_знищених_кораблів += 1
                                            elif f == 'попав':
                                                x2 = x2 - 1
                                                порядок = 0
                                                while порядок < 4 or кількість_знищених_кораблів < 20:
                                                    x2 = x2 - 1
                                                    биті_клитинки_x.append(x2)
                                                    print(x2, '|', y)
                                                    f = input('(Промах, попав, вбив)')
                                                    if f == 'Промах':
                                                        порядок = 4
                                                        break
                                                    elif f == 'вбив':
                                                        кількість_знищених_кораблів += 1
                                                        break
                                                    elif f == 'попав':
                                                        x2 = x2 - 1
                                                        кількість_знищених_кораблів += 1

        порядок = 0
        y2 = y
        y2 = y2 + 1
        биті_клитинки_y.append(y2)
        print(x, '|', y2)
        f = input('(Промах, попав, вбив)')
        if f == 'вбив':
            кількість_знищених_кораблів += 1
        elif f == 'попав':
            y2 += 1
            порядок = 0
            while порядок < 4 or кількість_знищених_кораблів < 20:
                y2 = y2 + 1
                биті_клитинки_y.append(y2)
                print(x, '|', y2)
                f = input('(Промах, попав, вбив)')
                if f == 'Промах':
                    порядок = 4
                    break
                elif f == 'вбив':
                    кількість_знищених_кораблів += 1
                    break
                elif f == 'попав':
                    y2 += 1
                    кількість_знищених_кораблів += 1
                    порядок = 0
                    биті_клитинки_y.append(y2)
                    print(x, '|', y2)
                    f = input('(Промах, попав, вбив)')
                    if f == 'вбив':
                        кількість_знищених_кораблів += 1
                    elif f == 'попав':
                        y2 += 1
                        порядок = 0
                        while порядок < 4 or кількість_знищених_кораблів < 20:
                            y2 = y2 + 1
                            биті_клитинки_y.append(y2)
                            print(x, '|', y2)
                            f = input('(Промах, попав, вбив)')
                            if f == 'Промах':
                                порядок = 4
                                break
                            elif f == 'вбив':
                                кількість_знищених_кораблів += 1
                                break
                            elif f == 'попав':
                                y2 += 1
                                кількість_знищених_кораблів += 1
                                порядок = 0
                                биті_клитинки_y.append(y2)
                                print(x, '|', y2)
                                f = input('(Промах, попав, вбив)')
                                if f == 'вбив':
                                    кількість_знищених_кораблів += 1
                                elif f == 'попав':
                                    y2 += 1
                                    порядок = 0
                                    while порядок < 4 or кількість_знищених_кораблів < 20:
                                        y2 = y2 + 1
                                        биті_клитинки_y.append(y2)
                                        print(x, '|', y2)
                                        f = input('(Промах, попав, вбив)')
                                        if f == 'Промах':
                                            порядок = 4
                                            break
                                        elif f == 'вбив':
                                            кількість_знищених_кораблів += 1
                                            break
                                        elif f == 'попав':
                                            y2 += 1
                                            кількість_знищених_кораблів += 1
                                            порядок = 0
                                            биті_клитинки_y.append(y2)
                                            print(x, '|', y2)
                                            f = input('(Промах, попав, вбив)')
                                            if f == 'вбив':
                                                кількість_знищених_кораблів += 1
                                            elif f == 'попав':
                                                y2 += 1
                                                порядок = 0
                                                while порядок < 4 or кількість_знищених_кораблів < 20:
                                                    y2 = y2 + 1
                                                    биті_клитинки_y.append(y2)
                                                    print(x, '|', y2)
                                                    f = input('(Промах, попав, вбив)')
                                                    if f == 'Промах':
                                                        порядок = 4
                                                        break
                                                    elif f == 'вбив':
                                                        кількість_знищених_кораблів += 1
                                                        break
                                                    elif f == 'попав':
                                                        y2 += 1
                                                        кількість_знищених_кораблів += 1

        порядок = 0
        y2 = y
        y2 = y2 + 1
        биті_клитинки_y.append(y2)
        print(x, '|', y2)
        f = input('(Промах, попав, вбив)')
        if f == 'вбив':
            кількість_знищених_кораблів += 1
        elif f == 'попав':
            y2 += 1
            порядок = 0
            while порядок < 4 or кількість_знищених_кораблів < 20:
                y2 = y2 + 1
                биті_клитинки_y.append(y2)
                print(x, '|', y2)
                f = input('(Промах, попав, вбив)')
                if f == 'Промах':
                    порядок = 4
                    break
                elif f == 'вбив':
                    кількість_знищених_кораблів += 1
                    break
                elif f == 'попав':
                    y2 += 1
                    кількість_знищених_кораблів += 1
                    порядок = 0
                    биті_клитинки_y.append(y2)
                    print(x, '|', y2)
                    f = input('(Промах, попав, вбив)')
                    if f == 'вбив':
                        кількість_знищених_кораблів += 1
                    elif f == 'попав':
                        y2 += 1
                        порядок = 0
                        while порядок < 4 or кількість_знищених_кораблів < 20:
                            y2 = y2 + 1
                            биті_клитинки_y.append(y2)
                            print(x, '|', y2)
                            f = input('(Промах, попав, вбив)')
                            if f == 'Промах':
                                порядок = 4
                                break
                            elif f == 'вбив':
                                кількість_знищених_кораблів += 1
                                break
                            elif f == 'попав':
                                y2 += 1
                                кількість_знищених_кораблів += 1
                                порядок = 0
                                биті_клитинки_y.append(y2)
                                print(x, '|', y2)
                                f = input('(Промах, попав, вбив)')
                                if f == 'вбив':
                                    кількість_знищених_кораблів += 1
                                elif f == 'попав':
                                    y2 += 1
                                    порядок = 0
                                    while порядок < 4 or кількість_знищених_кораблів < 20:
                                        y2 = y2 + 1
                                        биті_клитинки_y.append(y2)
                                        print(x, '|', y2)
                                        f = input('(Промах, попав, вбив)')
                                        if f == 'Промах':
                                            порядок = 4
                                            break
                                        elif f == 'вбив':
                                            кількість_знищених_кораблів += 1
                                            break
                                        elif f == 'попав':
                                            y2 += 1
                                            кількість_знищених_кораблів += 1
                                            порядок = 0
                                            биті_клитинки_y.append(y2)
                                            print(x, '|', y2)
                                            f = input('(Промах, попав, вбив)')
                                            if f == 'вбив':
                                                кількість_знищених_кораблів += 1
                                            elif f == 'попав':
                                                y2 += 1
                                                порядок = 0
                                                while порядок < 4 or кількість_знищених_кораблів < 20:
                                                    y2 = y2 + 1
                                                    биті_клитинки_y.append(y2)
                                                    print(x, '|', y2)
                                                    f = input('(Промах, попав, вбив)')
                                                    if f == 'Промах':
                                                        порядок = 4
                                                        break
                                                    elif f == 'вбив':
                                                        кількість_знищених_кораблів += 1
                                                        break
                                                    elif f == 'попав':
                                                        y2 += 1
                                                        кількість_знищених_кораблів += 1

print('кінець гри')