порядок = 0
y1 = y
y1 = y1 + 1
биті_клитинки_y.append(y1)
print(x, '|', y1)
f = input('(Промах, попав, вбив)')
if f == 'вбив':
    кількість_знищених_кораблів += 1
elif f == 'попав':
    y1 += 1
    порядок = 0
    while порядок < 4 or кількість_знищених_кораблів < 20:
        y1 = y1 + 1
        биті_клитинки_y.append(y1)
        print(x, '|', y1)
        f = input('(Промах, попав, вбив)')
        if f == 'Промах':
            порядок = 4
            break
        elif f == 'вбив':
            кількість_знищених_кораблів += 1
            break
        elif f == 'попав':
            y1 += 1
            кількість_знищених_кораблів += 1
            порядок = 0
            биті_клитинки_y.append(y1)
            print(x, '|', y1)
            f = input('(Промах, попав, вбив)')
            if f == 'вбив':
                кількість_знищених_кораблів += 1
            elif f == 'попав':
                y1 += 1
                порядок = 0
                while порядок < 4 or кількість_знищених_кораблів < 20:
                    y1 = y1 + 1
                    биті_клитинки_y.append(y1)
                    print(x, '|', y1)
                    f = input('(Промах, попав, вбив)')
                    if f == 'Промах':
                        порядок = 4
                        break
                    elif f == 'вбив':
                        кількість_знищених_кораблів += 1
                        break
                    elif f == 'попав':
                        y1 += 1
                        кількість_знищених_кораблів += 1
                        порядок = 0
                        биті_клитинки_y.append(y1)
                        print(x, '|', y1)
                        f = input('(Промах, попав, вбив)')
                        if f == 'вбив':
                            кількість_знищених_кораблів += 1
                        elif f == 'попав':
                            y1 += 1
                            порядок = 0
                            while порядок < 4 or кількість_знищених_кораблів < 20:
                                y1 = y1 + 1
                                биті_клитинки_y.append(y1)
                                print(x, '|', y1)
                                f = input('(Промах, попав, вбив)')
                                if f == 'Промах':
                                    порядок = 4
                                    break
                                elif f == 'вбив':
                                    кількість_знищених_кораблів += 1
                                    break
                                elif f == 'попав':
                                    y1 += 1
                                    кількість_знищених_кораблів += 1
                                    порядок = 0
                                    биті_клитинки_y.append(y1)
                                    print(x, '|', y1)
                                    f = input('(Промах, попав, вбив)')
                                    if f == 'вбив':
                                        кількість_знищених_кораблів += 1
                                    elif f == 'попав':
                                        y1 += 1
                                        порядок = 0
                                        while порядок < 4 or кількість_знищених_кораблів < 20:
                                            y1 = y1 + 1
                                            биті_клитинки_y.append(y1)
                                            print(x, '|', y1)
                                            f = input('(Промах, попав, вбив)')
                                            if f == 'Промах':
                                                порядок = 4
                                                break
                                            elif f == 'вбив':
                                                кількість_знищених_кораблів += 1
                                                break
                                            elif f == 'попав':
                                                y1 += 1
                                                кількість_знищених_кораблів += 1
