from random import *

обстріляні_координати = []
знищені_палуби = 0
кількість_палуб = 0

розмір_поля = 20
всього_палуб = 34

def outline(тип_пострілу, корабельні_палуби, x, y):
    if тип_пострілу == "x1":
        обстріляні_координати.append(str(x + 1) + str(y - 1))
        i = 0
        for i in range(корабельні_палуби + 1):
            обстріляні_координати.append(str(x - i) + str(y - 1))

        обстріляні_координати.append(str(x + 1) + str(y))
        обстріляні_координати.append(str(x - корабельні_палуби) + str(y))

        обстріляні_координати.append(str(x + 1) + str(y + 1))
        i = 0
        for i in range(корабельні_палуби + 1):
            обстріляні_координати.append(str(x - i) + str(y + 1))


    if тип_пострілу == "x2":
        обстріляні_координати.append(str(x - 1) + str(y - 1))
        i = 0
        for i in range(корабельні_палуби + 1):
            обстріляні_координати.append(str(x + i) + str(y - 1))

        обстріляні_координати.append(str(x - 1) + str(y))
        обстріляні_координати.append(str(x + корабельні_палуби) + str(y))

        обстріляні_координати.append(str(x - 1) + str(y + 1))
        i = 0
        for i in range(корабельні_палуби + 1):
            обстріляні_координати.append(str(x + i) + str(y + 1))


    if тип_пострілу == "y1":
        обстріляні_координати.append(str(x - 1) + str(y + 1))
        i = 0
        for i in range(корабельні_палуби + 1):
            обстріляні_координати.append(str(x - 1) + str(y - i))

        обстріляні_координати.append(str(x) + str(y + 1))
        обстріляні_координати.append(str(x) + str(y - корабельні_палуби))

        обстріляні_координати.append(str(x + 1) + str(y + 1))
        i = 0
        for i in range(корабельні_палуби + 1):
            обстріляні_координати.append(str(x + 1) + str(y - i))


    if тип_пострілу == "y2":
        обстріляні_координати.append(str(x - 1) + str(y - 1))
        i = 0
        for i in range(корабельні_палуби + 1):
            обстріляні_координати.append(str(x - 1) + str(y + i))

        обстріляні_координати.append(str(x) + str(y - 1))
        обстріляні_координати.append(str(x) + str(y + корабельні_палуби))

        обстріляні_координати.append(str(x + 1) + str(y - 1))
        i = 0
        for i in range(корабельні_палуби + 1):
            обстріляні_координати.append(str(x + 1) + str(y + i))


while знищені_палуби < всього_палуб:

    дозвіл_на_биття_по_y1 = True
    дозвіл_на_биття_по_y2 = True
    дозвіл_на_биття_по_x2 = True
    x = randint(1, розмір_поля)
    y = randint(1, розмір_поля)
    i = обстріляні_координати.count(str(x) + str(y))

    while i != 0:
        x = randint(1, розмір_поля)
        y = randint(1, розмір_поля)
        i = обстріляні_координати.count(str(x) + str(y))

    обстріляні_координати.append(str(x) + str(y))
    print(x, " | ", y)

    f = input("(промах, попав, вбив): ")
    if f == "промах":
        continue

    elif f == "вбив":
        знищені_палуби += 1
        outline("x1", 1, x, y)
        continue

    elif f == "попав":
        знищені_палуби += 1
        кількість_палуб += 1


        дозвіл_на_биття_по_x1 = True
        x1 = x
        while дозвіл_на_биття_по_x1 == True:
            x1 += 1
            i = обстріляні_координати.count(str(x1) + str(y))
            if x1 < розмір_поля + 1 and i == 0:
                обстріляні_координати.append(str(x1) + str(y))
                print(x1, " | ", y)
                f = input("(промах, попав, вбив): ")

                if f == "промах":
                    дозвіл_на_биття_по_x1 = False

                elif f == "вбив":
                    знищені_палуби += 1
                    дозвіл_на_биття_по_y1 = False
                    дозвіл_на_биття_по_y2 = False
                    дозвіл_на_биття_по_x2 = False
                    дозвіл_на_биття_по_x1 = False
                    outline("x1", кількість_палуб, x1, y)

                elif f == "попав":
                    знищені_палуби += 1
                    дозвіл_на_биття_по_y1 = False
                    дозвіл_на_биття_по_y2 = False
                    кількість_палуб += 1
                    continue
            else:
                дозвіл_на_биття_по_x1 = False

        x2 = x
        while дозвіл_на_биття_по_x2 == True:
            x2 -= 1
            i = обстріляні_координати.count(str(x2) + str(y))
            if x2 > 0 and i == 0:
                обстріляні_координати.append(str(x2) + str(y))
                print(x2, " | ", y)
                f = input("(промах, попав, вбив): ")

                if f == "промах":
                    дозвіл_на_биття_по_x2 = False

                elif f == "вбив":
                    знищені_палуби += 1
                    дозвіл_на_биття_по_y1 = False
                    дозвіл_на_биття_по_y2 = False
                    дозвіл_на_биття_по_x2 = False
                    outline("x2", кількість_палуб, x2, y)

                elif f == "попав":
                    знищені_палуби += 1
                    кількість_палуб += 1
                    дозвіл_на_биття_по_y1 = False
                    дозвіл_на_биття_по_y2 = False
                    continue
            else:
                дозвіл_на_биття_по_x2 = False

        y1 = y
        while дозвіл_на_биття_по_y1 == True:
            y1 += 1
            i = обстріляні_координати.count(str(x) + str(y1))
            if y1 < розмір_поля + 1 and i == 0:
                обстріляні_координати.append(str(x) + str(y1))
                print(x, " | ", y1)
                f = input("(промах, попав, вбив): ")

                if f == "промах":
                    дозвіл_на_биття_по_y1 = False

                elif f == "вбив":
                    знищені_палуби += 1
                    дозвіл_на_биття_по_y1 = False
                    дозвіл_на_биття_по_y2 = False
                    outline("y1", кількість_палуб, x, y1)

                elif f == "попав":
                        знищені_палуби += 1
                        кількість_палуб += 1
                        continue
            else:
                дозвіл_на_биття_по_y1 = False

        y2 = y
        while дозвіл_на_биття_по_y2 == True:
            y2 -= 1
            i = обстріляні_координати.count(str(x) + str(y2))
            if y2 > 0 and i == 0:
                обстріляні_координати.append(str(x) + str(y2))
                print(x, " | ", y2)
                f = input("(промах, попав, вбив): ")

                if f == "промах":
                    дозвіл_на_биття_по_y2 = False

                elif f == "вбив":
                    знищені_палуби += 1
                    дозвіл_на_биття_по_y2 = False
                    outline("y2", кількість_палуб, x, y2)

                elif f == "попав":
                    знищені_палуби += 1
                    кількість_палуб += 1
                    continue
            else:
                дозвіл_на_биття_по_y2 = False
    else:
        print("Ти грав неправильно!")
        break
    кількість_палуб = 0

print("Кінець гри")