from turtle import *
from random import *

знищені_палуби = 0
кількість_палуб = 0

розмір_поля = 10
всього_палуб = 20
обстріляні_координати = []
for i in range(1, розмір_поля + 1):
    for j in range(1, розмір_поля + 1):
        обстріляні_координати.append(str(i) + "|" + str(j))

speed(-1)
goto(20, -20)
clear()
for o in range(4):
    forward(розмір_поля * 20)
    right(90)

def draw(x, y, type):
    up()
    goto(x * 20, -y * 20)
    down()

    if type == "промах":
        color("gray")
        begin_fill()
        for j in range(4):
            forward(20)
            right(90)
        end_fill()

    elif type == "інше":
        color("black")
        begin_fill()
        for j in range(4):
            forward(20)
            right(90)
        end_fill()

def outline_x1(корабельні_палуби, x, y):
    d = обстріляні_координати.count(str(x + 1) + "|" + str(y - 1))
    if x + 1 < розмір_поля + 1 and y - 1 > 0 and d != 0:
        обстріляні_координати.remove(str(x + 1) + "|" + str(y - 1))
        draw(x + 1, y - 1, "промах")
    i = 0
    for i in range(корабельні_палуби + 1):
        d = обстріляні_координати.count(str(x - i) + "|" + str(y - 1))
        if x - i > 0 and y - 1 > 0 and d != 0:
            обстріляні_координати.remove(str(x - i) + "|" + str(y - 1))
            draw(x - i, y - 1, "промах")

    d = обстріляні_координати.count(str(x + 1) + "|" + str(y))
    if x + 1 < розмір_поля + 1 and d != 0:
        обстріляні_координати.remove(str(x + 1) + "|" + str(y))
        draw(x + 1, y, "промах")
    d = обстріляні_координати.count(str(x - корабельні_палуби) + "|" + str(y))
    if x - корабельні_палуби > 0 and d != 0:
        обстріляні_координати.remove(str(x - корабельні_палуби) + "|" + str(y))
        draw(x - корабельні_палуби, y, "промах")

    d = обстріляні_координати.count(str(x + 1) + "|" + str(y + 1))
    if x + 1 < розмір_поля + 1 and y + 1 < розмір_поля + 1 and d != 0:
        обстріляні_координати.remove(str(x + 1) + "|" + str(y + 1))
        draw(x + 1, y + 1, "промах")
    i = 0
    for i in range(корабельні_палуби + 1):
        d = обстріляні_координати.count(str(x - i) + "|" + str(y + 1))
        if x - i > 0 and y + 1 < розмір_поля + 1 and d != 0:
            обстріляні_координати.remove(str(x - i) + "|" + str(y + 1))
            draw(x - i, y + 1, "промах")


def outline_x2(корабельні_палуби, x, y):
    d = обстріляні_координати.count(str(x - 1) + "|" + str(y - 1))
    if x - 1 > 0 and y - 1 > 0 and d != 0:
        обстріляні_координати.remove(str(x - 1) + "|" + str(y - 1))
        draw(x - 1, y - 1, "промах")
    i = 0
    for i in range(корабельні_палуби + 1):
        d = обстріляні_координати.count(str(x + i) + "|" + str(y - 1))
        if x + i < розмір_поля + 1 and y - 1 > 0 and d != 0:
            обстріляні_координати.remove(str(x + i) + "|" + str(y - 1))
            draw(x + i, y - 1, "промах")

    d = обстріляні_координати.count(str(x - 1) + "|" + str(y))
    if x - 1 > 0 and d != 0:
        обстріляні_координати.remove(str(x - 1) + "|" + str(y))
        draw(x - 1, y, "промах")
    d = обстріляні_координати.count(str(x + корабельні_палуби) + "|" + str(y))
    if x + корабельні_палуби < розмір_поля + 1 and d != 0:
        обстріляні_координати.remove(str(x + корабельні_палуби) + "|" + str(y))
        draw(x + корабельні_палуби, y, "промах")

    d = обстріляні_координати.count(str(x - 1) + "|" + str(y + 1))
    if x - 1 > 0 and y + 1 < розмір_поля + 1 and d != 0:
        обстріляні_координати.remove(str(x - 1) + "|" + str(y + 1))
        draw(x - 1, y + 1, "промах")
    i = 0
    for i in range(корабельні_палуби + 1):
        d = обстріляні_координати.count(str(x + i) + "|" + str(y + 1))
        if x + i < розмір_поля + 1 and y + 1 < розмір_поля + 1 and d != 0:
            обстріляні_координати.remove(str(x + i) + "|" + str(y + 1))
            draw(x + i, y + 1, "промах")


def outline_y1(корабельні_палуби, x, y):
    d = обстріляні_координати.count(str(x - 1) + "|" + str(y + 1))
    if y + 1 < розмір_поля + 1 and x - 1 > 0 and d != 0:
        обстріляні_координати.remove(str(x - 1) + "|" + str(y + 1))
        draw(x - 1, y + 1, "промах")
    i = 0
    for i in range(корабельні_палуби + 1):
        d = обстріляні_координати.count(str(x - 1) + "|" + str(y - i))
        if y - i > 0 and x - 1 > 0 and d != 0:
            обстріляні_координати.remove(str(x - 1) + "|" + str(y - i))
            draw(x - 1, y - i, "промах")

    d = обстріляні_координати.count(str(x) + "|" + str(y + 1))
    if y + 1 < розмір_поля + 1 and d != 0:
        обстріляні_координати.remove(str(x) + "|" + str(y + 1))
        draw(x, y + 1, "промах")
    d = обстріляні_координати.count(str(x) + "|" + str(y - корабельні_палуби))
    if y - корабельні_палуби > 0 and d != 0:
        обстріляні_координати.remove(str(x) + "|" + str(y - корабельні_палуби))
        draw(x, y - корабельні_палуби, "промах")

    d = обстріляні_координати.count(str(x + 1) + "|" + str(y + 1))
    if x + 1 < розмір_поля + 1 and y + 1 < розмір_поля + 1 and d != 0:
        обстріляні_координати.remove(str(x + 1) + "|" + str(y + 1))
        draw(x + 1, y + 1, "промах")
    i = 0
    for i in range(корабельні_палуби + 1):
        d = обстріляні_координати.count(str(x + 1) + "|" + str(y - i))
        if y - i > 0 and x + 1 < розмір_поля + 1 and d != 0:
            обстріляні_координати.remove(str(x + 1) + "|" + str(y - i))
            draw(x + 1, y - i, "промах")


def outline_y2(корабельні_палуби, x, y):
    d = обстріляні_координати.count(str(x - 1) + "|" + str(y - 1))
    if x - 1 > 0 and y - 1 > 0 and d != 0:
        обстріляні_координати.remove(str(x - 1) + "|" + str(y - 1))
        draw(x - 1, y - 1, "промах")
    i = 0
    for i in range(корабельні_палуби + 1):
        d = обстріляні_координати.count(str(x - 1) + "|" + str(y + i))
        if x - 1 < розмір_поля + 1 and y + i > 0 and d != 0:
            обстріляні_координати.remove(str(x - 1) + "|" + str(y + i))
            draw(x - 1, y + i, "промах")

    d = обстріляні_координати.count(str(x) + "|" + str(y - 1))
    if y - 1 > 0 and d != 0:
        обстріляні_координати.remove(str(x) + "|" + str(y - 1))
        draw(x, y - 1, "промах")
    d = обстріляні_координати.count(str(x) + "|" + str(y + корабельні_палуби))
    if y + корабельні_палуби > 0 and d != 0:
        обстріляні_координати.remove(str(x) + "|" + str(y + корабельні_палуби))
        draw(x, y + корабельні_палуби, "промах")

    d = обстріляні_координати.count(str(x + 1) + "|" + str(y - 1))
    if y - 1 > 0 and x + 1 < розмір_поля + 1 and d != 0:
        обстріляні_координати.remove(str(x + 1) + "|" + str(y - 1))
        draw(x + 1, y - 1, "промах")
    i = 0
    for i in range(корабельні_палуби + 1):
        d = обстріляні_координати.count(str(x + 1) + "|" + str(y + i))
        if y + i < розмір_поля + 1 and x + 1 < розмір_поля + 1 and d != 0:
            обстріляні_координати.remove(str(x + 1) + "|" + str(y + i))
            draw(x + 1, y + i, "промах")


while знищені_палуби < всього_палуб:

    дозвіл_на_биття_по_y1 = True
    дозвіл_на_биття_по_y2 = True
    дозвіл_на_биття_по_x2 = True
    a = choice(обстріляні_координати)
    обстріляні_координати.remove(a)
    x = ""
    q = 0
    while a[q] != "|":
        x = x + a[q]
        q = q + 1
    x = int(x)
    if len(str(x)) == 1:
        y = list(a)
        for g in range(2):
            y.pop(0)
        y = int("".join(y))
    elif len(str(x)) == 2:
        y = list(a)
        for g in range(3):
            y.pop(0)
        y = int("".join(y))
    print(x, " | ", y)

    f = input("(промах, попав, вбив): ")
    if f == "промах":
        draw(x, y, "промах")
        continue

    elif f == "вбив":
        знищені_палуби += 1
        draw(x, y, "інше")
        outline_x1(1, x, y)
        continue

    elif f == "попав":
        знищені_палуби += 1
        кількість_палуб += 1
        draw(x, y, "інше")


        дозвіл_на_биття_по_x1 = True
        x1 = x
        while дозвіл_на_биття_по_x1 == True:
            x1 += 1
            i = обстріляні_координати.count(str(x1) + "|" + str(y))
            if x1 < розмір_поля + 1 and i != 0:
                обстріляні_координати.remove(str(x1) + "|" + str(y))
                print(x1, " | ", y)
                f = input("(промах, попав, вбив): ")

                if f == "промах":
                    дозвіл_на_биття_по_x1 = False
                    draw(x1, y, "промах")

                elif f == "вбив":
                    знищені_палуби += 1
                    дозвіл_на_биття_по_y1 = False
                    дозвіл_на_биття_по_y2 = False
                    дозвіл_на_биття_по_x2 = False
                    дозвіл_на_биття_по_x1 = False
                    кількість_палуб += 1
                    draw(x1, y, "інше")
                    outline_x1(кількість_палуб, x1, y)

                elif f == "попав":
                    знищені_палуби += 1
                    дозвіл_на_биття_по_y1 = False
                    дозвіл_на_биття_по_y2 = False
                    кількість_палуб += 1
                    draw(x1, y, "інше")
                    continue

                if обстріляні_координати.count(str(x1) + "|" + str(y)) != 0:
                    обстріляні_координати.remove(str(x1) + "|" + str(y))
            else:
                дозвіл_на_биття_по_x1 = False

        x2 = x
        while дозвіл_на_биття_по_x2 == True:
            x2 -= 1
            i = обстріляні_координати.count(str(x2) + "|" + str(y))
            if x2 > 0 and i != 0:
                print(x2, " | ", y)
                f = input("(промах, попав, вбив): ")

                if f == "промах":
                    дозвіл_на_биття_по_x2 = False
                    draw(x2, y, "промах")

                elif f == "вбив":
                    знищені_палуби += 1
                    дозвіл_на_биття_по_y1 = False
                    дозвіл_на_биття_по_y2 = False
                    дозвіл_на_биття_по_x2 = False
                    кількість_палуб += 1
                    draw(x2, y, "інше")
                    outline_x2(кількість_палуб, x2, y)

                elif f == "попав":
                    знищені_палуби += 1
                    кількість_палуб += 1
                    дозвіл_на_биття_по_y1 = False
                    дозвіл_на_биття_по_y2 = False
                    draw(x2, y, "інше")
                    continue
                if обстріляні_координати.count(str(x2) + "|" + str(y)) != 0:
                    обстріляні_координати.remove(str(x2) + "|" + str(y))
            else:
                дозвіл_на_биття_по_x2 = False

        y1 = y
        while дозвіл_на_биття_по_y1 == True:
            y1 += 1
            i = обстріляні_координати.count(str(x) + "|" + str(y1))
            if y1 < розмір_поля + 1 and i != 0:
                обстріляні_координати.remove(str(x) + "|" + str(y1))
                print(x, " | ", y1)
                f = input("(промах, попав, вбив): ")

                if f == "промах":
                    дозвіл_на_биття_по_y1 = False
                    draw(x, y1, "промах")

                elif f == "вбив":
                    знищені_палуби += 1
                    дозвіл_на_биття_по_y1 = False
                    дозвіл_на_биття_по_y2 = False
                    кількість_палуб += 1
                    draw(x, y1, "інше")
                    outline_y1(кількість_палуб, x, y1)

                elif f == "попав":
                        знищені_палуби += 1
                        кількість_палуб += 1
                        draw(x, y1, "інше")
                        continue
                if обстріляні_координати.count(str(x) + "|" + str(y1)) != 0:
                    обстріляні_координати.remove(str(x) + "|" + str(y1))
            else:
                дозвіл_на_биття_по_y1 = False

        y2 = y
        while дозвіл_на_биття_по_y2 == True:
            y2 -= 1
            i = обстріляні_координати.count(str(x) + "|" + str(y2))
            if y2 > 0 and i != 0:
                обстріляні_координати.remove(str(x) + "|" + str(y2))
                print(x, " | ", y2)
                f = input("(промах, попав, вбив): ")

                if f == "промах":
                    дозвіл_на_биття_по_y2 = False
                    draw(x, y2, "промах")

                elif f == "вбив":
                    знищені_палуби += 1
                    дозвіл_на_биття_по_y2 = False
                    кількість_палуб += 1
                    draw(x, y2, "інше")
                    outline_y2(кількість_палуб, x, y2)

                elif f == "попав":
                    знищені_палуби += 1
                    кількість_палуб += 1
                    draw(x, y2, "інше")
                    continue
                if обстріляні_координати.count(str(x) + "|" + str(y2)) != 0:
                    обстріляні_координати.remove(str(x) + "|" + str(y2))
            else:
                дозвіл_на_биття_по_y2 = False
    else:
        print("Ти грав неправильно!")
        break
    кількість_палуб = 0

print("Кінець гри")

for k in range(999999):
    left(1)